app/Controllers/Dosen.php

    public function index()
    {
        $model = new DosenModel();
        $data['dosen'] = $model->findAll();
---
SELECT *
FROM `dosen`