app/Controllers/Jurusan.php

SELECT *
FROM `jurusan`
---
    public function index()
    {
        $model = new JurusanModel();
        $data['jurusan'] = $model->findAll();