app/Controllers/Kontrak.php

    public function index()
    {
        $model = new KontrakModel();
        $data['kontrak'] = $model
            ->select('kontrak.*, mahasiswa.nama_mahasiswa, mata_kuliah.nama_mata_kuliah, dosen.nama_dosen')
            ->join('mahasiswa', 'mahasiswa.mahasiswa_id = kontrak.mahasiswa_id')
            ->join('mata_kuliah', 'mata_kuliah.mata_kuliah_id = kontrak.mata_kuliah_id')
            ->join('dosen', 'dosen.dosen_id = kontrak.dosen_id')
            ->findAll();
---
SELECT `kontrak`.*, `mahasiswa`.`nama_mahasiswa`, `mata_kuliah`.`nama_mata_kuliah`, `dosen`.`nama_dosen`
FROM `kontrak`
JOIN `mahasiswa` ON `mahasiswa`.`mahasiswa_id` = `kontrak`.`mahasiswa_id`
JOIN `mata_kuliah` ON `mata_kuliah`.`mata_kuliah_id` = `kontrak`.`mata_kuliah_id`
JOIN `dosen` ON `dosen`.`dosen_id` = `kontrak`.`dosen_id`