app/Controllers/Login.php

SELECT *
FROM `users`
WHERE `username` = 'admin'
 LIMIT 1
---
    public function auth()
    {
        $usersModel = new UsersModel();
        $username = $this->request->getPost('username');
        $password = $this->request->getPost('password');

        $user = $usersModel->where('username', $username)->first();