app/Controllers/Mahasiswa.php

SELECT `mahasiswa`.*, `jurusan`.`nama_jurusan`
FROM `mahasiswa`
LEFT JOIN `jurusan` ON `jurusan`.`jurusan_id` = `mahasiswa`.`jurusan_id`
---
    public function index()
    {
        $model = new MahasiswaModel();

        $data['mahasiswa'] = $model
            ->select('mahasiswa.*, jurusan.nama_jurusan')
            ->join('jurusan', 'jurusan.jurusan_id = mahasiswa.jurusan_id', 'left')
            ->findAll();