app/Controllers/MataKuliah.php

    public function index()
    {
        $model = new MataKuliahModel();
        $data['matakuliah'] = $model->findAll();
---
SELECT *
FROM `mata_kuliah`